#include <iostream>
using namespace std;

#if 0
int main()
{

	//数据类型 数组名[行数][列数] = { {数据1，数据2 } ，{数据3，数据4 },...... };
	int a[2][2] = { {1,1},{2,2} };
	//数据类型 数组名[行数][列数] = { 数据1，数据2，数据3，数据4, ...... };
	char a[2][2] = { 1,1,2,2 };
	//数据类型 数组名[][列数] = { 数据1，数据2，数据3，数据4,...... };
	double a[][3] = {1,1,2,2};
	//数据类型 数组名[行数][列数] = { 0 };  // 把全部的元素初始化为0。
	float a[2][2] = { 0 };
	//数据类型 数组名[行数][列数] = { };    // 把全部的元素初始化为0。
	long a[2][2] = {};

	// 注意：如果{}内不足数组长度个数据，剩余数据用0补全，但是，不建议这么用，你可能在数组中漏了某个值。如果想把数组中全部的元素初始化为0，可以在{}内只填一个0或什么也不填。
	//	C++11标准可以不写等于号。

	return 0;
}
#endif // 0
